
* Script.py

#+begin_src python :results output
# Import libraries
import numpy as np
import pandas as pd

# Import data
dogs = pd.read_csv('dog_data.csv')

# Subset to just whippets, terriers, and pitbulls
dogs_wtp = dogs[dogs.breed.isin(['whippet', 'terrier', 'pitbull'])]

# Subset to just poodles and shihtzus
dogs_ps = dogs[dogs.breed.isin(['poodle', 'shihtzu'])]

# Inspect first few rows of data
print(dogs.head())

# Save the is_rescue column for whippets
whippet_rescue = dogs.is_rescue[dogs.breed == 'whippet']

# How many whippets are rescues 
num_whippet_rescues = np.sum(whippet_rescue == 1)
print("Whippet rescues: ", num_whippet_rescues)

# How many whippets are in total
num_whippets = len(whippet_rescue)
print("Total of whippets: ", num_whippets)

# Run a binomial test
from scipy.stats import binomtest
pval = binomtest(num_whippet_rescues, num_whippets, 0.08)
print(pval)

# Save the weights of whippets, terriers and pitbulls
wt_whippets = dogs.weight[dogs.breed == 'whippet']
wt_terriers = dogs.weight[dogs.breed == 'terrier']
wt_pitbulls = dogs.weight[dogs.breed == 'pitbull']

# Run an ANOVA
from scipy.stats import f_oneway
Fstat, pval = f_oneway(wt_whippets, wt_terriers, wt_pitbulls)
print(pval)

# Run Tukey's range test
from statsmodels.stats.multicomp import pairwise_tukeyhsd
output = pairwise_tukeyhsd(dogs_wtp.weight, dogs_wtp.breed)
print(output)

#+end_src

#+RESULTS:
#+begin_example
   is_rescue  weight  tail_length  ...  is_hypoallergenic      name      breed
0          0       6         2.25  ...                  0      Huey  chihuahua
1          0       4         5.36  ...                  0   Cherish  chihuahua
2          0       7         3.63  ...                  1     Becka  chihuahua
3          0       5         0.19  ...                  0     Addie  chihuahua
4          0       5         0.37  ...                  1  Beverlee  chihuahua

[5 rows x 9 columns]
Whippet rescues:  6
Total of whippets:  100
BinomTestResult(k=6, n=100, alternative='two-sided', statistic=0.06, pvalue=0.5811780106238111)
3.276415588274815e-17
  Multiple Comparison of Means - Tukey HSD, FWER=0.05  
=======================================================
 group1  group2 meandiff p-adj   lower    upper  reject
-------------------------------------------------------
pitbull terrier   -13.24    0.0 -16.7278 -9.7522   True
pitbull whippet    -3.34 0.0638  -6.8278  0.1478  False
terrier whippet      9.9    0.0   6.4122 13.3878   True
-------------------------------------------------------
#+end_example
